Documents/РасчетПроцентов395.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РасчетПроцентов395</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебноеРешение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейВГоду</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РасчетПроцентов395/Ext/ObjectModule.bsl
Процедура ЗагрузитьГрафикНачислений() Экспорт

	Остатки = Неопределено; 
	ЭтотОбъект.РасчетПроцентов.Очистить();
	
	СписокПлатежей = ЭтотОбъект.ИсторияПлатежей.Выгрузить();
	СписокПлатежей.Сортировать("ДатаПлатежа");
	РассчитатьГрафикИндексации(ЭтотОбъект, СписокПлатежей); 

КонецПроцедуры

Процедура ЗаполнитьДанные() Экспорт
	//ЭтотОбъект.ИсторияПлатежей.Очистить();
	ЭтотОбъект.Территория = "Свердловская область";
	ЭтотОбъект.ДатаРешения = ОбъектыСервер.ПолучитьЗначениеСвойства(ЭтотОбъект.Займ, "0498     ");
	ЭтотОбъект.СуммаЗадолженности = ЭтотОбъект.Займ.Замена_СуммаПоСудАкту;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(ЗадолженностьПоОбъектам.Период, ДЕНЬ) КАК ДатаПлатежа,
	                      |	ЗадолженностьПоОбъектам.СуммаДО КАК СуммаПлатежа
	                      |ИЗ
	                      |	РегистрНакопления.ЗадолженностьПоОбъектам КАК ЗадолженностьПоОбъектам
	                      |ГДЕ
	                      |	ЗадолженностьПоОбъектам.Объект = &Объект
	                      |	И ТИПЗНАЧЕНИЯ(ЗадолженностьПоОбъектам.Регистратор) = ТИП(документ.ПоступлениеПлатежей)");
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Займ);
	ЭтотОбъект.ИсторияПлатежей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура РассчитатьГрафикИндексации(стрДанные, СписокПлатежей)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СписокПлатежей.СуммаПлатежа КАК СуммаПлатежа,
	                      |	СписокПлатежей.ДатаПлатежа КАК ДатаПлатежа
	                      |ПОМЕСТИТЬ вт_Платежи
	                      |ИЗ
	                      |	&СписокПлатежей КАК СписокПлатежей
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	вт_Платежи.ДатаПлатежа КАК ДатаПлатежа,
	                      |	вт_Платежи.СуммаПлатежа КАК СуммаПлатежа,
	                      |	НАЧАЛОПЕРИОДА(вт_Платежи.ДатаПлатежа, МЕСЯЦ) КАК МесяцСписания
	                      |ИЗ
	                      |	вт_Платежи КАК вт_Платежи
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МесяцСписания,
	                      |	ДатаПлатежа");
	Запрос.УстановитьПараметр("СписокПлатежей", СписокПлатежей);
	СписокПлатежей = Запрос.Выполнить().Выгрузить();
	
	БазаНачисления = стрДанные.СуммаЗадолженности;
	КУплате = стрДанные.СуммаЗадолженности;
	ОстаткиОсновнойДолг = стрДанные.СуммаЗадолженности;
	ОстаткиПроценты = 0;
		
	Капитализация = стрДанные.КапитализацияПроцентов;
	
	Если стрДанные.ИсключитьКрайниеМесяцы Тогда
		стрДатаРасчета = НачалоМесяца(стрДанные.ДатаРасчета) - 24 * 3600;
		НачалоПериода = КонецМесяца(стрДанные.ДатаРешения) + 1;
	Иначе
		стрДатаРасчета = стрДанные.ДатаРасчета;
		НачалоПериода = стрДанные.ДатаРешения;
	КонецЕсли;
	
	Пока НачалоПериода <= стрДатаРасчета Цикл
		Платежи = СписокПлатежей.НайтиСтроки(Новый Структура("МесяцСписания", НачалоПериода));
		Для Каждого Платеж Из Платежи Цикл
			стр = ЭтотОбъект.РасчетПроцентов.Добавить();
			стр.НачалоПериода = Платеж.ДатаПлатежа;
			стр.СуммаПлатежа = Платеж.СуммаПлатежа;
		КонецЦикла;
		
		стр = ЭтотОбъект.РасчетПроцентов.Добавить();
		
		стр.НачалоПериода = НачалоПериода;
		
		КонецПериода = мин(стрДатаРасчета, НачалоДня(КонецМесяца(НачалоПериода)));
		
		стр.КонецПериода = КонецПериода;
		
		НачалоПериода = КонецПериода + 24 * 3600;
	КонецЦикла;
	
	Для Каждого стр Из ЭтотОбъект.РасчетПроцентов Цикл
		Если Капитализация Тогда
			БазаНачисления = КУплате;
		Иначе
			БазаНачисления = ОстаткиОсновнойДолг;
		КонецЕсли;
		стр.СуммаЗадолженности = БазаНачисления;
		СуммаПлатежа = стр.СуммаПлатежа;

		Если СуммаПлатежа = 0 Тогда
			стр.Дни = (стр.КонецПериода - стр.НачалоПериода) / 24 / 3600 + 1;
			стр.ИПЦ = ПолучитьЗначениеИПЦ(НачалоМесяца(стр.НачалоПериода));
			
			КоличествоДнейВМесяце = КоличествоДнейВМесяце(стр.НачалоПериода);

			стр.Проценты = ?(стр.ИПЦ > 0, РасчетЗадолженностиМФО.ОкруглитьЧисло((стр.ИПЦ - 100) * БазаНачисления * стр.Дни / КоличествоДнейВМесяце / 100, Перечисления.ПорядкиОкругления.Окр0_01), 0);
		КонецЕсли;
		
		стр.СуммаЗадолженности = ОстаткиОсновнойДолг;
		стр.ОстаткиПроценты = ОстаткиПроценты + стр.Проценты;
		
		Если СуммаПлатежа > 0 И Капитализация Тогда
			стр.ОплатаПроценты = мин(стр.ОстаткиПроценты, СуммаПлатежа);
			стр.ОстаткиПроценты = стр.ОстаткиПроценты - стр.ОплатаПроценты;
			СуммаПлатежа = СуммаПлатежа - стр.ОплатаПроценты;
		КонецЕсли;
		
		Если СуммаПлатежа > 0 Тогда
			стр.ОплатаОсновнойДолг = мин(стр.СуммаЗадолженности, СуммаПлатежа);
			стр.СуммаЗадолженности = стр.СуммаЗадолженности - стр.ОплатаОсновнойДолг;
			СуммаПлатежа = СуммаПлатежа - стр.ОплатаОсновнойДолг;
		КонецЕсли; 
		стр.Переплата = СуммаПлатежа;
		стр.КУплате = стр.СуммаЗадолженности + стр.ОстаткиПроценты;
		
		КУплате = стр.КУплате;
		ОстаткиПроценты = стр.ОстаткиПроценты;
		ОстаткиОсновнойДолг = стр.СуммаЗадолженности;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗначениеИПЦ(Период)
	Менеджер = РегистрыСведений.ЗначенияИПЦ.СоздатьМенеджерЗаписи();
	Менеджер.ПериодИПЦ = Период;
	Менеджер.Территория = ЭтотОбъект.Территория;
	
	Менеджер.Прочитать();
	Возврат Менеджер.Значение;
КонецФункции

Функция КоличествоДнейВМесяце(Период)
	Возврат (НачалоДня(КонецМесяца(Период)) - НачалоМесяца(Период))/3600/24 + 1;
КонецФункции
